Repository: Gargoros/GreetingsApp_Swift
Catalog: Shared/Localizable.xcstrings
Source language: en
Languages: be_by, ru

source: Are you ready to,
be_by: Ці гатовыя вы да,
ru: Готовы ли вы к,

source: Belarusian
be_by: Беларускі
ru: Белорусский

source: boom.
be_by: бум.
ru: бум.

source: Click on text and disc
be_by: Націсніце на тэкст і абмеркаванне
ru: Нажмите на текст и обсуждение

source: Coding is the language of the future.
be_by: Кадаванне-гэта мова будучыня.
ru: Кодирование - это язык будущего.

source: English
be_by: Англійскі
ru: Английский

source: Greeting in SwiftUI App
be_by: Прывітанне ў дадатку Swift UI
ru: Приветствие в приложении Swift UI

source: Hello there!
be_by: Прывітанне!
ru: Привет!

source: I came in with near zero programming knowledge.
be_by: Я прыйшоў сюды амаль з нулявымі веды ў галіне праграмавання.
ru: Я пришел сюда почти с нулевыми знаниями в области программирования.

source: I could not have gotten this far without the support.
be_by: Я б не змог зайсці так далёка без вашай падтрымкі.
ru: Я бы не смог зайти так далеко без вашей поддержки.

source: I learned the fundamentals for programming!
be_by: Я вывучыў асновы праграмавання!
ru: Я изучил основы программирования!

source: Learning iOS programming to create iOS apps
be_by: Вывучэнне праграмавання на iOS для стварэння прыкладанняў на iOS
ru: Изучение программирования на iOS для создания приложений на iOS

source: Learning to write programs stretches your mind.
be_by: Навучанне напісання праграм расцягвае ваш розум.
ru: Обучение написанию программ растягивает ваш разум.

source: Russian
be_by: Рускі
ru: Русский

source: strat exploring?
be_by: пачаць даследаваць?
ru: начать исследовать?

source: Text will be randomly generated and observe nice animations!
be_by: Тэкст будзе генеравацца выпадковым чынам і суправаджацца прыемнай анімацыяй!
ru: Текст будет генерироваться случайным образом и сопровождаться приятной анимацией!

source: The End.
be_by: канец.
ru: конец.

source: Welcome to Swift
be_by: Сардэчна запрашаем у Swift
ru: Добро пожаловать в Swift

source: When you throw yourself out there great things happen.
be_by: Калі ты кідаешся туды, адбываюцца вялікія рэчы.
ru: Когда ты бросаешься туда, происходят великие вещи.
